#pragma once

// DirectX
#include <d3d12.h>

// WRL
#include <wrl.h>

// C++
#include <cstdint>
#include <string>

// 自作
#include "EngineStructs.h"
#include "Mesh.h"
#include "Material.h"
#include "BlendMode.h"

class Particle {
public:

	//=============================================================================================//
	// インスタンス数

	static const uint32_t kNumInstance = 10;

	//=============================================================================================//
	// 初期化処理

	void Initialize ();

	//=============================================================================================//
	// 更新処理

	void Update (const Matrix4x4& viewProjectionMatrix);

	//=============================================================================================//
	// 描画処理

	void Draw ();

	//=============================================================================================//
	// 終了処理

	void Finalize ();

	//=============================================================================================//
	// 色設定

	void SetColor (const Vector4& color);

	//=============================================================================================//
	// Texture設定

	void SetTexture (const std::string& textureName);

	//=============================================================================================//
	// BlendMode設定

	void SetBlendMode (BlendMode blendMode);

private:

	//=============================================================================================//
	// Instancing用SRVを置くHeapの番号（Textureは0番から順に使うので、Heapの末尾を使う）

	static const uint32_t kInstancingSrvIndex = 127;

	//=============================================================================================//
	// Mesh

	Mesh* mesh_ = nullptr;

	//=============================================================================================//
	// Material

	Material* material_ = nullptr;

	//=============================================================================================//
	// Instancing用のTransformationMatrixリソース

	Microsoft::WRL::ComPtr<ID3D12Resource> instancingResource_ = nullptr;

	//=============================================================================================//
	// 書き込むためのアドレス

	TransformationMatrix* instancingData_ = nullptr;

	//=============================================================================================//
	// Instancing用SRVのGPUHandle

	D3D12_GPU_DESCRIPTOR_HANDLE instancingSrvHandleGPU_{};

	//=============================================================================================//
	// Transform

	TransformData transforms_[kNumInstance]{};

	//=============================================================================================//
	// 描画するインスタンス数

	uint32_t numInstance_ = kNumInstance;

	//=============================================================================================//
	// BlendMode

	BlendMode blendMode_ = kBlendModeNormal;
};
