#pragma once

// 自作
#include "WinApp.h"
#include "DirectXCommon.h"
#include "Input.h"
#include "GraphicsSystem.h"
#include "AudioSystem.h"
#include "SceneManager.h"

class Engine {
public:

	//=============================================================================================//
	// 初期化処理

	void Initialize ();

	//=============================================================================================//
	// 実行処理

	void Run ();

	//=============================================================================================//
	// 終了処理

	void Finalize ();

private:

	//=============================================================================================//
	// Window

	WinApp* winApp_ = nullptr;

	//=============================================================================================//
	// DirectXCommon

	DirectXCommon* dxCommon_ = nullptr;

	//=============================================================================================//
	// Input

	Input* input_ = nullptr;

	//=============================================================================================//
	// GraphicsSystem

	GraphicsSystem* graphicsSystem_ = nullptr;

	//=============================================================================================//
	// AudioSystem

	AudioSystem* audioSystem_ = nullptr;

	//=============================================================================================//
	// SceneManager

	SceneManager* sceneManager_ = nullptr;
};