#pragma once

// 自作
#include "IScene.h"
#include "ObjectManager.h"
#include "EngineStructs.h"
#include "ResourceManager.h"
#include "Camera.h"
#include "Sprite.h"
#include "SpriteManager.h"

class GameScene : public IScene {
public:

	//=============================================================================================//
	// 初期化処理

	void Initialize () override;

	//=============================================================================================//
	// 更新処理

	void Update (Input* input) override;

	//=============================================================================================//
	// 描画処理

	void Draw (ID3D12GraphicsCommandList* commandList, GraphicsSystem* graphicsSystem) override;

	//=============================================================================================//
	// 終了処理

	void Finalize () override;

	//=============================================================================================//
	// ResourceManager設定

	void SetResourceManager (ResourceManager* resourceManager);

	//=============================================================================================//
	// Device設定

	void SetDevice (ID3D12Device* device);

	//=============================================================================================//
	// 画面サイズ設定

	void SetWindowSize (int32_t width, int32_t height);

	//=============================================================================================//
	// 終了判定

	bool IsFinished () override;

	void SetContext(const SceneContext& sceneContext) override;

private:

	//=============================================================================================//
	// Device

	ID3D12Device* device_ = nullptr;

	//=============================================================================================//
	// ResourceManager

	ResourceManager* resourceManager_ = nullptr;

	//=============================================================================================//
	// ObjectManager

	ObjectManager* objectManager_ = nullptr;

	//=============================================================================================//
	// Camera

	Camera* camera_ = nullptr;

	//=============================================================================================//
	// 画面幅

	int32_t clientWidth_ = 0;

	//=============================================================================================//
	// 画面高さ

	int32_t clientHeight_ = 0;

	//=============================================================================================//
	// 終了フラグ

	bool isFinished_ = false;
	
	//=============================================================================================//
	// Sprite

	

	//=============================================================================================//
	// SpriteManager

	
};