#pragma once

// DirectX
#include <d3d12.h>

// 自作
#include "GraphicsSystem.h"
#include "Input.h"

//=================================================================================================//
// シーン基底クラス

class IScene {
public:

	virtual ~IScene () = default;

	//=============================================================================================//
	// 初期化処理

	virtual void Initialize () = 0;

	//=============================================================================================//
	// 更新処理

	virtual void Update (
		Input* input) = 0;

	//=============================================================================================//
	// 描画処理

	virtual void Draw (
		ID3D12GraphicsCommandList* commandList,
		GraphicsSystem* graphicsSystem) = 0;

	//=============================================================================================//
	// 終了処理

	virtual void Finalize () = 0;

	//=============================================================================================//
	// 終了判定

	virtual bool IsFinished () = 0;
};