#pragma once

// DirectX
#include <d3d12.h>

// C++
#include <cstdint>

// 自作
#include "IScene.h"
#include "TitleScene.h"
#include "GameScene.h"
#include "GraphicsSystem.h"
#include "ResourceManager.h"
#include "Input.h"

class SceneManager {
public:

	//=============================================================================================//
	// 初期化処理

	void Initialize(int32_t clientWidth, int32_t clientHeight);

	//=============================================================================================//
	// 更新処理

	void Update(Input* input);

	//=============================================================================================//
	// 描画処理

	void Draw();

	//=============================================================================================//
	// 終了処理

	void Finalize();

private:

	//=============================================================================================//
	// CurrentScene

	IScene* currentScene_ = nullptr;

	//=============================================================================================//
	// Device

	ID3D12Device* device_ = nullptr;

	//=============================================================================================//
	// ResourceManager

	ResourceManager* resourceManager_ = nullptr;

	//=============================================================================================//
	// ClientWidth

	int32_t clientWidth_ = 0;

	//=============================================================================================//
	// ClientHeight

	int32_t clientHeight_ = 0;

	//=============================================================================================//
	// SceneContext

	SceneContext sceneContext_{};
};