#pragma once

// 自作
#include "IScene.h"

class TitleScene : public IScene {
public:

	//=============================================================================================//
	// 初期化処理

	void Initialize () override;

	//=============================================================================================//
	// 更新処理

	void Update (Input* input) override;

	//=============================================================================================//
	// 描画処理

	void Draw (ID3D12GraphicsCommandList* commandList,	GraphicsSystem* graphicsSystem) override;

	//=============================================================================================//
	// 終了処理

	void Finalize () override;

	//=============================================================================================//
	// 終了判定

	bool IsFinished () override;

private:

	//=============================================================================================//
	// 終了フラグ

	bool isFinished_ = false;
};