#include "TitleScene.h"


//=================================================================================================//
// SceneContext設定

void TitleScene::SetContext(const SceneContext& sceneContext) {

	device_ = sceneContext.device;

	resourceManager_ = sceneContext.resourceManager;

	clientWidth_ = sceneContext.clientWidth;

	clientHeight_ = sceneContext.clientHeight;
}

//=================================================================================================//
// 初期化処理

void TitleScene::Initialize() {

	//=============================================================================================//
	// SpriteManager生成


	//=============================================================================================//
	// BackGroundSprite生成


}

//=================================================================================================//
// 更新処理

void TitleScene::Update(Input* input) {

	//=============================================================================================//
	// Enterで終了

	if (input->IsTriggerKey(DIK_RETURN)) {

		isFinished_ = true;
	}

	//=============================================================================================//
	// SpriteManager更新

}

//=================================================================================================//
// 描画処理

void TitleScene::Draw(ID3D12GraphicsCommandList* commandList, GraphicsSystem* graphicsSystem) {

	//=============================================================================================//
	// SpriteManager描画


}

//=================================================================================================//
// 終了処理

void TitleScene::Finalize() {

	//=============================================================================================//
	// SpriteManager解放

	
}

//=================================================================================================//
// 終了判定

bool TitleScene::IsFinished() {

	return isFinished_;
}