#include "TitleScene.h"


//=================================================================================================//
// SceneContext設定

void TitleScene::SetContext(const SceneContext& sceneContext) {

	clientWidth_ = sceneContext.clientWidth;

	clientHeight_ = sceneContext.clientHeight;
}

//=================================================================================================//
// 初期化処理

void TitleScene::Initialize() {

}

//=================================================================================================//
// 更新処理

void TitleScene::Update(Input* input) {

	//=============================================================================================//
	// Enterで終了

	if (input->IsTriggerKey(DIK_RETURN)) {

		isFinished_ = true;
	}

}

//=================================================================================================//
// 描画処理

void TitleScene::Draw() {

}

//=================================================================================================//
// 終了処理

void TitleScene::Finalize() {

	
}

//=================================================================================================//
// 終了判定

bool TitleScene::IsFinished() {

	return isFinished_;
}