#include <Windows.h>

#include "Engine.h"
#include "LogSystem.h"

//=================================================================================================//
// エントリーポイント

int WINAPI WinMain (
	_In_ HINSTANCE,
	_In_opt_ HINSTANCE,
	_In_ LPSTR,
	_In_ int) {

	//=============================================================================================//
	// COM初期化

	CoInitializeEx (0, COINIT_MULTITHREADED);

	//=============================================================================================//
	// LogSystem初期化

	LogSystem::Initialize ();

	//=============================================================================================//
	// Engine

	Engine engine;

	engine.Initialize ();

	engine.Run ();

	engine.Finalize ();

	//=============================================================================================//
	// LogSystem終了

	LogSystem::Finalize ();

	//=============================================================================================//
	// COM終了

	CoUninitialize ();

	return 0;
}