#pragma once

// Windows
#include <Windows.h>

// C++
#include <cstdint>
#include <array>
#include <chrono>

// DirectX
#include <d3d12.h>
#include <dxgi1_6.h>

// WRL
#include <wrl.h>


// DescriptorHeap
#include "DescriptorHeapManager.h"

class WinApp;

class DirectXCommon {
public:

	//=============================================================================================//
	// BackBuffer数

	static const uint32_t kBufferCount = 2;

	//=============================================================================================//
	// SRVの最大数

	static const uint32_t kMaxSrvCount = 128;

	//=============================================================================================//
	// 初期化処理

	void Initialize(WinApp* winApp);

	//=============================================================================================//
	// 描画前処理

	void PreDraw();

	//=============================================================================================//
	// 描画後処理

	void PostDraw();

	//=============================================================================================//
	// 終了処理

	void Finalize();

	//=============================================================================================//
	// Getter

	ID3D12Device* GetDevice() { return device_.Get(); }

	ID3D12GraphicsCommandList* GetCommandList() { return commandList_.Get(); }

	DescriptorHeapManager* GetSrvHeap() { return &srvHeap_; }

private:

	//=============================================================================================//
	// DebugLayer初期化

	void InitializeDebugLayer();

	//=============================================================================================//
	// Device初期化

	void InitializeDevice();

	//=============================================================================================//
	// Command系初期化

	void InitializeCommand();

	//=============================================================================================//
	// SwapChain初期化

	void InitializeSwapChain();

	//=============================================================================================//
	// RTV初期化

	void InitializeRenderTargetView();

	//=============================================================================================//
	// Fence初期化

	void InitializeFence();

	//=============================================================================================//
	// DSV初期化

	void InitializeDepthStencilView();

	//=============================================================================================//
	// SRV初期化

	void InitializeShaderResourceView();

	//=============================================================================================//
	// Viewport矩形初期化

	void InitializeViewport();

	//=============================================================================================//
	// ScissorRect初期化

	void InitializeScissorRect();

	//=============================================================================================//
	// FPS固定初期化

	void InitializeFixFPS();

	//=============================================================================================//
	// FPS固定更新

	void UpdateFixFPS();

private:

	//=============================================================================================//
	// WinApp

	WinApp* winApp_ = nullptr;

	//=============================================================================================//
	// 記録時間(FPS固定用)

	std::chrono::steady_clock::time_point reference_;

	//=============================================================================================//
	// BackBufferIndex

	UINT backBufferIndex_ = 0;

	//=============================================================================================//
	// Fence

	uint64_t fenceValue_ = 0;

	HANDLE fenceEvent_ = nullptr;

	//=============================================================================================//
	// Viewport

	D3D12_VIEWPORT viewport_{};

	//=============================================================================================//
	// ScissorRect

	D3D12_RECT scissorRect_{};

	//=============================================================================================//
	// Factory

	Microsoft::WRL::ComPtr<IDXGIFactory7> dxgiFactory_;

	//=============================================================================================//
	// Adapter

	Microsoft::WRL::ComPtr<IDXGIAdapter4> useAdapter_;

	//=============================================================================================//
	// Device

	Microsoft::WRL::ComPtr<ID3D12Device> device_;

	//=============================================================================================//
	// CommandQueue

	Microsoft::WRL::ComPtr<ID3D12CommandQueue> commandQueue_;

	//=============================================================================================//
	// CommandAllocator

	Microsoft::WRL::ComPtr<ID3D12CommandAllocator> commandAllocator_;

	//=============================================================================================//
	// CommandList

	Microsoft::WRL::ComPtr<ID3D12GraphicsCommandList> commandList_;

	//=============================================================================================//
	// SwapChain

	Microsoft::WRL::ComPtr<IDXGISwapChain4> swapChain_;

	//=============================================================================================//
	// BackBuffer

	std::array<Microsoft::WRL::ComPtr<ID3D12Resource>, kBufferCount> swapChainResources_;

	//=============================================================================================//
	// RTVHeap

	Microsoft::WRL::ComPtr<ID3D12DescriptorHeap> rtvDescriptorHeap_;

	//=============================================================================================//
	// RTVHandle

	D3D12_CPU_DESCRIPTOR_HANDLE rtvHandles_[kBufferCount]{};

	//=============================================================================================//
	// Fence

	Microsoft::WRL::ComPtr<ID3D12Fence> fence_;

	//=============================================================================================//
	// DSVHeap

	DescriptorHeapManager dsvHeap_;

	//=============================================================================================//
	// SRVHeap

	DescriptorHeapManager srvHeap_;

	//=============================================================================================//
	// DepthStencilResource

	Microsoft::WRL::ComPtr<ID3D12Resource> depthStencilResource_;
};
