#pragma once

// C++
#include <cstdint>

// 自作
#include "EngineStructs.h"

class Camera {
public:

	//=============================================================================================//
	// 初期化処理

	void Initialize (int32_t clientWidth, int32_t clientHeight);

	//=============================================================================================//
	// 更新処理

	void Update ();

	//=============================================================================================//
	// Transform設定

	void SetTransform (const TransformData& transform);

	void SetParent(Transform* parent);

	//=============================================================================================//
	// Transform取得

	TransformData GetTransform () const;

	//=============================================================================================//
	// ViewMatrix取得

	const Matrix4x4& GetViewMatrix () const;

	//=============================================================================================//
	// ProjectionMatrix取得

	const Matrix4x4& GetProjectionMatrix () const;

	//=============================================================================================//
	// ViewProjectionMatrix取得

	const Matrix4x4& GetViewProjectionMatrix () const;

private:

	//=============================================================================================//
	// Transform

	TransformData transform_{};

	//=============================================================================================//
	// ViewMatrix

	Matrix4x4 viewMatrix_{};

	//=============================================================================================//
	// ProjectionMatrix

	Matrix4x4 projectionMatrix_{};

	//=============================================================================================//
	// ViewProjectionMatrix

	Matrix4x4 viewProjectionMatrix_{};

	//=============================================================================================//
	// 画面幅

	int32_t clientWidth_ = 0;

	//=============================================================================================//
	// 画面高さ

	int32_t clientHeight_ = 0;
};