#pragma once

// Windows
#include <Windows.h>

// C++
#include <fstream>
#include <cassert>

// XAudio2
#include <xaudio2.h>

//=============================================================================================//
// チャンクヘッダ

struct ChunkHeader {
	char id[4];
	int32_t size;
};

//=============================================================================================//
// RIFFヘッダチャンク

struct RiffHeader {
	ChunkHeader chunk;
	char type[4];
};

//=============================================================================================//
// FMTチャンク

struct FormatChunk {
	ChunkHeader chunk;
	WAVEFORMATEX fmt;
};

//=============================================================================================//
// 音声データ

struct SoundData {
	WAVEFORMATEX wfex;
	BYTE* pBuffer;
	unsigned int bufferSize;
};

class AudioSystem {
public:

	//=============================================================================================//
	// 初期化処理

	void Initialize ();

	//=============================================================================================//
	// 終了処理

	void Finalize ();

	//=============================================================================================//
	// 音声読み込み

	SoundData LoadWave (const char* filename);

	//=============================================================================================//
	// 音声解放

	void UnloadWave (SoundData* soundData);

	//=============================================================================================//
	// 音声再生

	void PlayWave (const SoundData& soundData);

private:

	//=============================================================================================//
	// XAudio2

	IXAudio2* xAudio2_ = nullptr;

	//=============================================================================================//
	// MasterVoice

	IXAudio2MasteringVoice* masterVoice_ = nullptr;
};