#pragma once

// Windows
#include <Windows.h>

// C++
#include <cstdint>
#include <array>

// DirectX
#include <d3d12.h>
#include <dxgi1_6.h>

// WRL
#include <wrl.h>


// DescriptorHeap
#include "DescriptorHeapManager.h"

class WinApp;

class DirectXCommon {
public:

	//=============================================================================================//
	// 初期化処理

	void Initialize(WinApp* winApp);

	//=============================================================================================//
	// フレーム開始

	void BeginFrame();

	//=============================================================================================//
	// フレーム終了

	void EndFrame();

	//=============================================================================================//
	// 終了処理

	void Finalize();

	//=============================================================================================//
	// Getter

	ID3D12Device* GetDevice() { return device_.Get(); }

	ID3D12GraphicsCommandList* GetCommandList() { return commandList_.Get(); }

private:

	//=============================================================================================//
	// DebugLayer初期化

	void InitializeDebugLayer();

	//=============================================================================================//
	// Device初期化

	void InitializeDevice();

	//=============================================================================================//
	// Command系初期化

	void InitializeCommand();

	//=============================================================================================//
	// SwapChain初期化

	void InitializeSwapChain();

	//=============================================================================================//
	// RTV初期化

	void InitializeRenderTargetView();

	//=============================================================================================//
	// Fence初期化

	void InitializeFence();

	//=============================================================================================//
	// DSV初期化

	void InitializeDepthStencilView();

	//=============================================================================================//
	// Viewport矩形初期化

	void InitializeViewport();

	//=============================================================================================//
	// ScissorRect初期化

	void InitializeScissorRect();

private:

	//=============================================================================================//
	// WinApp

	WinApp* winApp_ = nullptr;

	//=============================================================================================//
	// BackBufferIndex

	UINT backBufferIndex_ = 0;

	//=============================================================================================//
	// Fence

	uint64_t fenceValue_ = 0;

	HANDLE fenceEvent_ = nullptr;

	//=============================================================================================//
	// Viewport

	D3D12_VIEWPORT viewport_{};

	//=============================================================================================//
	// ScissorRect

	D3D12_RECT scissorRect_{};

	//=============================================================================================//
	// Factory

	Microsoft::WRL::ComPtr<IDXGIFactory7> dxgiFactory_;

	//=============================================================================================//
	// Adapter

	Microsoft::WRL::ComPtr<IDXGIAdapter4> useAdapter_;

	//=============================================================================================//
	// Device

	Microsoft::WRL::ComPtr<ID3D12Device> device_;

	//=============================================================================================//
	// CommandQueue

	Microsoft::WRL::ComPtr<ID3D12CommandQueue> commandQueue_;

	//=============================================================================================//
	// CommandAllocator

	Microsoft::WRL::ComPtr<ID3D12CommandAllocator> commandAllocator_;

	//=============================================================================================//
	// CommandList

	Microsoft::WRL::ComPtr<ID3D12GraphicsCommandList> commandList_;

	//=============================================================================================//
	// SwapChain

	Microsoft::WRL::ComPtr<IDXGISwapChain4> swapChain_;

	//=============================================================================================//
	// BackBuffer

	std::array<Microsoft::WRL::ComPtr<ID3D12Resource>, 2> swapChainResources_;

	//=============================================================================================//
	// RTVHeap

	Microsoft::WRL::ComPtr<ID3D12DescriptorHeap> rtvDescriptorHeap_;

	//=============================================================================================//
	// RTVHandle

	D3D12_CPU_DESCRIPTOR_HANDLE rtvHandles_[2]{};

	//=============================================================================================//
	// Fence

	Microsoft::WRL::ComPtr<ID3D12Fence> fence_;

	//=============================================================================================//
	// DSVHeap

	DescriptorHeapManager dsvHeap_;

	//=============================================================================================//
	// DepthStencilResource

	Microsoft::WRL::ComPtr<ID3D12Resource> depthStencilResource_;
};
