#pragma once

#include <Windows.h>
#include <cstdint>

class WinApp {
public:

	//=============================================================================================//
	// 初期化

	void Initialize();

	//=============================================================================================//
	// 更新

	void Update();

	//=============================================================================================//
	// 終了リクエストがあるか

	bool IsEndRequest() const { return isEndRequest_; }

	//=============================================================================================//
	// 終了処理

	void Finalize();

	//=============================================================================================//
	// Getter

	HWND GetHwnd() const { return hwnd_; }

	HINSTANCE GetHInstance() const { return wc_.hInstance; }

	int32_t GetClientWidth() const { return kClientWidth_; }

	int32_t GetClientHeight() const { return kClientHeight_; }
private:

	//=============================================================================================//
	// ウィンドウプロシージャ

	static LRESULT CALLBACK WindowProc(HWND hwnd, UINT msg, WPARAM wParam, LPARAM lParam);

private:

	//=============================================================================================//
	// WindowSize

	static const int32_t kClientWidth_ = 1280;
	static const int32_t kClientHeight_ = 720;

	//=============================================================================================//
	// Window

	HWND hwnd_ = nullptr;

	//=============================================================================================//
	// WindowClass

	WNDCLASS wc_{};

	//=============================================================================================//
	// Message

	MSG msg_{};

	//=============================================================================================//
	// 終了リクエスト

	bool isEndRequest_ = false;
};